РП/src/Documents/ПроцессПодготовкиБюджетов/ПроцессПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроцессПодготовкиБюджетов</name>
  <basedOn>Catalog.ЭтапыПодготовкиБюджетов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельБюджетирования</name>
    <type>
      <types>CatalogRef.МоделиБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЭтапов</name>
    <type>
      <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроцессовПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКОписанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиИерархии</name>
    <attributes>
      <name>ГруппаЭтапов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПовторяемыйЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиРасчета</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПовторяемыйЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДлительности</name>
      <type>
        <types>EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>НеВыполняется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/Enums/СтатусыПроцессовПодготовкиБюджетов/СтатусыПроцессовПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессовПодготовкиБюджетов</name>
  <enumValues>
    <name>Незапущен</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

РП/src/Documents/ПроцессПодготовкиБюджетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ПометкаУдаления Тогда
		Если Статус <> Перечисления.СтатусыПроцессовПодготовкиБюджетов.Завершен Тогда
			Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Отменен;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Выполняется Тогда
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
			УстановитьПривилегированныйРежим(Истина);
			Задачи.БюджетнаяЗадача.ФормированиеБюджетныхЗадач(МодельБюджетирования);
			УстановитьПривилегированныйРежим(Ложь);
		Иначе
			ФоновыеЗадания.Выполнить("БюджетированиеСервер.ФормированиеБюджетныхЗадач");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
